## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                     |
|--------|-----------------------------------------------------------------------------|
| delete | `aws_cloudwatch_log_metric_filter.github-arc-write-alarm[0]`                |
|        | `aws_cloudwatch_metric_alarm.github-arc-runner-write-alarm[0]`              |
| add    | `aws_cloudwatch_log_metric_filter.callback-max-retry-failures[0]`           |
|        | `aws_cloudwatch_log_metric_filter.github-arc-runner-alarm[0]`               |
|        | `aws_cloudwatch_metric_alarm.github-arc-runner-error-alarm[0]`              |
|        | `aws_cloudwatch_metric_alarm.service-callback-too-many-failures-warning[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.callback-max-retry-failures[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "callback-max-retry-failures" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name           = "callback-max-retry-failures"
      + pattern        = "Retry: send_delivery_status_to_service has retried the max num of times for callback url"

      + metric_transformation {
          + dimensions = {
              + "notification_id" = "$.notification_id"
              + "service_id"      = "$.service"
              + "url"             = "$.url"
            }
          + name       = "callback-max-retry-failures"
          + namespace  = "LogMetrics"
          + unit       = "None"
          + value      = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.github-arc-runner-alarm[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "github-arc-runner-alarm" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application"
      + name           = "GitHub ARC Runners Write Alarm"
      + pattern        = "{ $.kubernetes.pod_name = \"github-arc-ss-staging-*-runner-*\"  && $.log = \"*ERROR*\" }"

      + metric_transformation {
          + name      = "aggregating-github-arc-runner-alarm"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.github-arc-write-alarm[0] will be destroyed
  # (because aws_cloudwatch_log_metric_filter.github-arc-write-alarm is not in configuration)
  - resource "aws_cloudwatch_log_metric_filter" "github-arc-write-alarm" {
      - id             = "GitHub ARC Runners Write Alarm" -> null
      - log_group_name = "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application" -> null
      - name           = "GitHub ARC Runners Write Alarm" -> null
      - pattern        = "WRITE ERROR" -> null

      - metric_transformation {
          - dimensions = {} -> null
          - name       = "aggregating-github-arc-write-alarm" -> null
          - namespace  = "LogMetrics" -> null
          - unit       = "None" -> null
          - value      = "1" -> null
        }
    }

  # aws_cloudwatch_metric_alarm.github-arc-runner-error-alarm[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "github-arc-runner-error-alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "GitHub ARC Runners Are Failing"
      + alarm_name                            = "github-arc-runner-error-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "aggregating-github-arc-runner-alarm"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.github-arc-runner-write-alarm[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.github-arc-runner-write-alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "github-arc-runner-write-alarm" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ] -> null
      - alarm_description         = "GitHub ARC Runners Are Failing - Check Version Deprecation" -> null
      - alarm_name                = "github-arc-runner-write-alarm" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:github-arc-runner-write-alarm" -> null
      - comparison_operator       = "LessThanThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "github-arc-runner-write-alarm" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "aggregating-github-arc-write-alarm" -> null
      - namespace                 = "LogMetrics" -> null
      - ok_actions                = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 1 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

  # aws_cloudwatch_metric_alarm.service-callback-too-many-failures-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "service-callback-too-many-failures-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Service reached the max number of callback retries 5 times in 30 minutes"
      + alarm_name                            = "service-callback-too-many-failures-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "callback-max-retry-failures"
      + namespace                             = "LogMetrics"
      + period                                = 1800
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }

Plan: 4 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.callback-max-retry-failures[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN...
```

</details>
